RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_mdf.h
/** @defgroup MDF_ErrorCode MDF error code
  * @{
  */
#define MDF_ERROR_NONE                  0x00000000U /*!< No error */
#define MDF_ERROR_ACQUISITION_OVERFLOW  0x00000001U /*!< Overflow occurs during acquisition */
#define MDF_ERROR_RSF_OVERRUN           0x00000002U /*!< Overrun occurs on reshape filter */
#define MDF_ERROR_CLOCK_ABSENCE         0x00000004U /*!< Clock absence detection occurs */
#define MDF_ERROR_SATURATION            0x00000010U /*!< Saturation detection occurs */
#define MDF_ERROR_DMA                   0x00000040U /*!< DMA error occurs */
#if (USE_HAL_MDF_REGISTER_CALLBACKS == 1)
#define MDF_ERROR_INVALID_CALLBACK      0x00000080U /*!< Invalid callback error occurs */
#endif /* USE_HAL_MDF_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @defgroup MDF_ClockTriggerSource MDF output clock trigger source
  * @{
  */
#define MDF_CLOCK_TRIG_TRGO    0x00000000U
#define MDF_CLOCK_TRIG_EXTI15  MDF_CKGCR_TRGSRC_1
/**
  * @}
  */

/** @defgroup MDF_ClockTriggerEdge MDF output clock trigger edge
  * @{
  */
#define MDF_CLOCK_TRIG_RISING_EDGE   0x00000000U        /*!< Rising edge */
#define MDF_CLOCK_TRIG_FALLING_EDGE  MDF_CKGCR_TRGSENS  /*!< Falling edge */
/**
  * @}
  */

/** @defgroup MDF_OuputClockPins MDF output clock pins
  * @{
  */
#define MDF_OUTPUT_CLOCK_0    MDF_CKGCR_CCK0DIR      /*!< MDF_CCK0 is used as output clock */
#define MDF_OUTPUT_CLOCK_1    MDF_CKGCR_CCK1DIR      /*!< MDF_CCK1 is used as output clock */
#define MDF_OUTPUT_CLOCK_ALL (MDF_CKGCR_CCK0DIR | \
                              MDF_CKGCR_CCK1DIR)     /*!< MDF_CCK0 and MDF_CCK1 are used as output clock */
/**
  * @}
  */

/** @defgroup MDF_SitfMode MDF serial interface mode
  * @{
  */
#define MDF_SITF_LF_MASTER_SPI_MODE       0x00000000U           /*!< Low frequency master SPI mode */
#define MDF_SITF_NORMAL_SPI_MODE          MDF_SITFCR_SITFMOD_0  /*!< Normal SPI mode */
#define MDF_SITF_MANCHESTER_FALLING_MODE  MDF_SITFCR_SITFMOD_1  /*!< Manchester mode rising edge logic 0
                                                                     and falling edge logic 1 */
#define MDF_SITF_MANCHESTER_RISING_MODE   MDF_SITFCR_SITFMOD    /*!< Manchester mode rising edge logic 1
                                                                     and falling edge logic 0 */
/**
  * @}
  */

/** @defgroup MDF_SitfClockSource MDF serial interface clock source
  * @{
  */
#define MDF_SITF_CCK0_SOURCE  0x00000000U          /*!< Common clock 0 source */
#define MDF_SITF_CCK1_SOURCE  MDF_SITFCR_SCKSRC_0  /*!< Common clock 1 source */
/**
  * @}
  */

/** @defgroup MDF_FilterBitstream MDF filter bitstream
  * @{
  */
#define MDF_BITSTREAM0_RISING   0x00000000U
#define MDF_BITSTREAM0_FALLING  MDF_BSMXCR_BSSEL_0
/**
  * @}
  */

/** @defgroup MDF_ReshapeDecimationRatio MDF reshape filter decimation ratio
  * @{
  */
#define MDF_RSF_DECIMATION_RATIO_4  0x00000000U          /*!< Reshape filter decimation ratio is 4 */
#define MDF_RSF_DECIMATION_RATIO_1  MDF_DFLTRSFR_RSFLTD  /*!< Reshape filter decimation ratio is 1 */
/**
  * @}
  */

/** @defgroup MDF_HighPassCutOffFreq MDF high pass filter cut-off frequency
  * @{
  */
#define MDF_HPF_CUTOFF_0_000625FPCM  0x00000000U          /*!< Cut-off frequency of 0.000625xFpcm */
#define MDF_HPF_CUTOFF_0_00125FPCM   MDF_DFLTRSFR_HPFC_0  /*!< Cut-off frequency of 0.00125xFpcm */
#define MDF_HPF_CUTOFF_0_0025FPCM    MDF_DFLTRSFR_HPFC_1  /*!< Cut-off frequency of 0.0025xFpcm */
#define MDF_HPF_CUTOFF_0_0095FPCM    MDF_DFLTRSFR_HPFC    /*!< Cut-off frequency of 0.0095xFpcm */
/**
  * @}
  */

/** @defgroup MDF_SadMode MDF sound activity detector mode
  * @{
  */
#define MDF_SAD_VOICE_ACTIVITY_DETECTOR  0x00000000U         /*!< Voice activity detector */
#define MDF_SAD_SOUND_DETECTOR           MDF_SADCR_SADMOD_0  /*!< Sound detector */
#define MDF_SAD_AMBIENT_NOISE_DETECTOR   MDF_SADCR_SADMOD    /*!< Ambient noise detector */
/**
  * @}
  */

/** @defgroup MDF_SadFrameSize MDF sound activity detector frame size
  * @{
  */
#define MDF_SAD_8_PCM_SAMPLES    0x00000000U                               /*!< Frame size of 8 PCM samples */
#define MDF_SAD_16_PCM_SAMPLES   MDF_SADCR_FRSIZE_0                        /*!< Frame size of 16 PCM samples */
#define MDF_SAD_32_PCM_SAMPLES   MDF_SADCR_FRSIZE_1                        /*!< Frame size of 32 PCM samples */
#define MDF_SAD_64_PCM_SAMPLES  (MDF_SADCR_FRSIZE_0 | MDF_SADCR_FRSIZE_1)  /*!< Frame size of 64 PCM samples */
#define MDF_SAD_128_PCM_SAMPLES  MDF_SADCR_FRSIZE_2                        /*!< Frame size of 128 PCM samples */
#define MDF_SAD_256_PCM_SAMPLES (MDF_SADCR_FRSIZE_0 | MDF_SADCR_FRSIZE_2)  /*!< Frame size of 256 PCM samples */
#define MDF_SAD_512_PCM_SAMPLES  MDF_SADCR_FRSIZE                          /*!< Frame size of 512 PCM samples */
/**
  * @}
  */

/** @defgroup MDF_SadSoundTriggerEvent MDF sound activity detector trigger event
  * @{
  */
#define MDF_SAD_ENTER_DETECT       0x00000000U       /*!< Event when SAD enters in detect state */
#define MDF_SAD_ENTER_EXIT_DETECT  MDF_SADCR_DETCFG  /*!< Event when SAD enters or exits from detect state */
/**
  * @}
  */

/** @defgroup MDF_SadDataMemoryTransfer MDF sound activity detector data memory transfer mode
  * @{
  */
#define MDF_SAD_NO_MEMORY_TRANSFER         0x00000000U         /*!< No memory transfer */
#define MDF_SAD_MEMORY_TRANSFER_IN_DETECT  MDF_SADCR_DATCAP_0  /*!< Memory transfer only in detect state */
#define MDF_SAD_MEMORY_TRANSFER_ALWAYS     MDF_SADCR_DATCAP    /*!< Memory transfer always */
/**
  * @}
  */

/** @defgroup MDF_SadHangoverWindow MDF sound activity detector data hangover time window
  * @{
  */
#define MDF_SAD_HANGOVER_4_FRAMES    0x00000000U              /*!< Hangover window of 4 frames */
#define MDF_SAD_HANGOVER_8_FRAMES    MDF_SADCFGR_HGOVR_0      /*!< Hangover window of 8 frames */
#define MDF_SAD_HANGOVER_16_FRAMES   MDF_SADCFGR_HGOVR_1      /*!< Hangover window of 16 frames */
#define MDF_SAD_HANGOVER_32_FRAMES  (MDF_SADCFGR_HGOVR_0 | \
                                     MDF_SADCFGR_HGOVR_1)     /*!< Hangover window of 32 frames */
#define MDF_SAD_HANGOVER_64_FRAMES   MDF_SADCFGR_HGOVR_2      /*!< Hangover window of 64 frames */
#define MDF_SAD_HANGOVER_128_FRAMES (MDF_SADCFGR_HGOVR_0 | \
                                     MDF_SADCFGR_HGOVR_2)     /*!< Hangover window of 128 frames */
#define MDF_SAD_HANGOVER_256_FRAMES (MDF_SADCFGR_HGOVR_1 | \
                                     MDF_SADCFGR_HGOVR_2)     /*!< Hangover window of 256 frames */
#define MDF_SAD_HANGOVER_512_FRAMES (MDF_SADCFGR_HGOVR_0 | \
                                     MDF_SADCFGR_HGOVR_1 | \
                                     MDF_SADCFGR_HGOVR_2)     /*!< Hangover window of 512 frames */
/**
  * @}
  */

/** @defgroup MDF_SadLearningFrames MDF sound activity detector data learning frames
  * @{
  */
#define MDF_SAD_LEARNING_2_FRAMES   0x00000000U                                 /*!< 2 learning frames */
#define MDF_SAD_LEARNING_4_FRAMES   MDF_SADCFGR_LFRNB_0                         /*!< 4 learning frames */
#define MDF_SAD_LEARNING_8_FRAMES   MDF_SADCFGR_LFRNB_1                         /*!< 8 learning frames */
#define MDF_SAD_LEARNING_16_FRAMES (MDF_SADCFGR_LFRNB_0 | MDF_SADCFGR_LFRNB_1)  /*!< 16 learning frames */
#define MDF_SAD_LEARNING_32_FRAMES  MDF_SADCFGR_LFRNB                           /*!< 32 learning frames */
/**
  * @}
  */

/** @defgroup MDF_SadSignalNoiseThreshold MDF sound activity detector data signal to noise threshold
  * @{
  */
#define MDF_SAD_SIGNAL_NOISE_3_5DB   0x00000000U              /*!< Signal to noise threshold is 3.5dB */
#define MDF_SAD_SIGNAL_NOISE_6DB     MDF_SADCFGR_SNTHR_0      /*!< Signal to noise threshold is 6dB */
#define MDF_SAD_SIGNAL_NOISE_9_5DB   MDF_SADCFGR_SNTHR_1      /*!< Signal to noise threshold is 9.5dB */
#define MDF_SAD_SIGNAL_NOISE_12DB   (MDF_SADCFGR_SNTHR_0 | \
                                     MDF_SADCFGR_SNTHR_1)     /*!< Signal to noise threshold is 12dB */
#define MDF_SAD_SIGNAL_NOISE_15_6DB  MDF_SADCFGR_SNTHR_2      /*!< Signal to noise threshold is 15.6dB */
#define MDF_SAD_SIGNAL_NOISE_18DB   (MDF_SADCFGR_SNTHR_0 | \
                                     MDF_SADCFGR_SNTHR_2)     /*!< Signal to noise threshold is 18dB */
#define MDF_SAD_SIGNAL_NOISE_21_6DB (MDF_SADCFGR_SNTHR_1 | \
                                     MDF_SADCFGR_SNTHR_2)     /*!< Signal to noise threshold is 21.6dB */
#define MDF_SAD_SIGNAL_NOISE_24_1DB (MDF_SADCFGR_SNTHR_0 | \
                                     MDF_SADCFGR_SNTHR_1 | \
                                     MDF_SADCFGR_SNTHR_2)     /*!< Signal to noise threshold is 24.1dB */
#define MDF_SAD_SIGNAL_NOISE_27_6DB  MDF_SADCFGR_SNTHR_3      /*!< Signal to noise threshold is 27.6dB */
#define MDF_SAD_SIGNAL_NOISE_30_1DB (MDF_SADCFGR_SNTHR_0 | \
                                     MDF_SADCFGR_SNTHR_3)     /*!< Signal to noise threshold is 30.1dB */
/**
  * @}
  */

/** @defgroup MDF_FilterTriggerSource MDF filter trigger source
  * @{
  */
#define MDF_FILTER_TRIG_TRGO    0x00000000U
#define MDF_FILTER_TRIG_EXTI15  MDF_DFLTCR_TRGSRC_1
/**
  * @}
  */

/** @defgroup MDF_FilterTriggerEdge MDF filter trigger edge
  * @{
  */
#define MDF_FILTER_TRIG_RISING_EDGE   0x00000000U         /*!< Rising edge */
#define MDF_FILTER_TRIG_FALLING_EDGE  MDF_DFLTCR_TRGSENS  /*!< Falling edge */
/**
  * @}
  */

/** @defgroup MDF_DataSource MDF data source
  * @{
  */
#define MDF_DATA_SOURCE_BSMX     0x00000000U            /*!< Data from bitstream matrix */
#define MDF_DATA_SOURCE_ADCITF1  MDF_DFLTCICR_DATSRC_1  /*!< Data from ADC interface 1 */
#define MDF_DATA_SOURCE_ADCITF2  MDF_DFLTCICR_DATSRC    /*!< Data from ADC interface 2 */
/**
  * @}
  */

/** @defgroup MDF_CicMode MDF CIC mode
  * @{
  */
#define MDF_ONE_FILTER_SINC4  MDF_DFLTCICR_CICMOD_2      /*!< One filter in Sinc4 order */
#define MDF_ONE_FILTER_SINC5 (MDF_DFLTCICR_CICMOD_0 | \
                              MDF_DFLTCICR_CICMOD_2)     /*!< One filter in Sinc5 order */
/**
  * @}
  */

/** @defgroup MDF_AcquisitionMode MDF acquisition mode
  * @{
  */
#define MDF_MODE_ASYNC_CONT     0x00000000U              /*!< Asynchronous, continuous acquisition mode */
#define MDF_MODE_ASYNC_SINGLE   MDF_DFLTCR_ACQMOD_0      /*!< Asynchronous, single-shot acquisition mode.
                                                              @note Not available with SAD usage */
#define MDF_MODE_SYNC_CONT      MDF_DFLTCR_ACQMOD_1      /*!< Synchronous, continuous acquisition mode */
#define MDF_MODE_SYNC_SINGLE   (MDF_DFLTCR_ACQMOD_0 | \
                                MDF_DFLTCR_ACQMOD_1)     /*!< Synchronous, single-shot acquisition mode.
                                                              @note Not available with SAD usage */
#define MDF_MODE_WINDOW_CONT    MDF_DFLTCR_ACQMOD_2      /*!< Window, continuous acquisition mode.
                                                              @note Not available with SAD usage */
/**
  * @}
  */

/** @defgroup MDF_FifoThreshold MDF RXFIFO threshold
  * @{
  */
#define MDF_FIFO_THRESHOLD_NOT_EMPTY  0x00000000U     /*!< Event generated when RXFIFO is not empty */
#define MDF_FIFO_THRESHOLD_HALF_FULL  MDF_DFLTCR_FTH  /*!< Event generated when RXFIFO is half_full */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup MDF_Exported_Macros  MDF Exported Macros
  * @{
  */

