RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_mdf.h
#define IS_MDF_ACQUISITION_MODE(PARAM) (((PARAM) == MDF_MODE_ASYNC_CONT)   || \
                                        ((PARAM) == MDF_MODE_ASYNC_SINGLE) || \
                                        ((PARAM) == MDF_MODE_SYNC_CONT)    || \
                                        ((PARAM) == MDF_MODE_SYNC_SINGLE)  || \
                                        ((PARAM) == MDF_MODE_WINDOW_CONT))

#define IS_MDF_DISCARD_SAMPLES(PARAM) ((PARAM) <= 255U)

#define IS_MDF_FIFO_THRESHOLD(PARAM) (((PARAM) == MDF_FIFO_THRESHOLD_NOT_EMPTY) || \
                                      ((PARAM) == MDF_FIFO_THRESHOLD_HALF_FULL))

#define IS_MDF_TRIGGER_SOURCE(PARAM) (((PARAM) == MDF_FILTER_TRIG_TRGO) || \
                                      ((PARAM) == MDF_FILTER_TRIG_EXTI15))

#define IS_MDF_TRIGGER_EDGE(PARAM) (((PARAM) == MDF_FILTER_TRIG_RISING_EDGE) || \
                                    ((PARAM) == MDF_FILTER_TRIG_FALLING_EDGE))

#define IS_MDF_DATA_SOURCE(PARAM) (((PARAM) == MDF_DATA_SOURCE_BSMX)    || \
                                   ((PARAM) == MDF_DATA_SOURCE_ADCITF1) || \
                                   ((PARAM) == MDF_DATA_SOURCE_ADCITF2))

#define IS_MDF_DECIMATION_RATIO(PARAM) ((2U <= (PARAM)) && ((PARAM) <= 512U))

#define IS_MDF_GAIN(PARAM) ((-16 <= (PARAM)) && ((PARAM) <= 24))

#define IS_MDF_DELAY(PARAM) ((PARAM) <= 127U)

#define IS_MDF_RSF_DECIMATION_RATIO(PARAM) (((PARAM) == MDF_RSF_DECIMATION_RATIO_4) || \
                                            ((PARAM) == MDF_RSF_DECIMATION_RATIO_1))

#define IS_MDF_HPF_CUTOFF_FREQ(PARAM) (((PARAM) == MDF_HPF_CUTOFF_0_000625FPCM) || \
                                       ((PARAM) == MDF_HPF_CUTOFF_0_00125FPCM)  || \
                                       ((PARAM) == MDF_HPF_CUTOFF_0_0025FPCM)   || \
                                       ((PARAM) == MDF_HPF_CUTOFF_0_0095FPCM))

#define IS_MDF_SAD_MODE(PARAM) (((PARAM) == MDF_SAD_VOICE_ACTIVITY_DETECTOR) || \
                                ((PARAM) == MDF_SAD_SOUND_DETECTOR)          || \
                                ((PARAM) == MDF_SAD_AMBIENT_NOISE_DETECTOR))

#define IS_MDF_SAD_FRAME_SIZE(PARAM) (((PARAM) == MDF_SAD_8_PCM_SAMPLES)   || \
                                      ((PARAM) == MDF_SAD_16_PCM_SAMPLES)  || \
                                      ((PARAM) == MDF_SAD_32_PCM_SAMPLES)  || \
                                      ((PARAM) == MDF_SAD_64_PCM_SAMPLES)  || \
                                      ((PARAM) == MDF_SAD_128_PCM_SAMPLES) || \
                                      ((PARAM) == MDF_SAD_256_PCM_SAMPLES) || \
                                      ((PARAM) == MDF_SAD_512_PCM_SAMPLES))

#define IS_MDF_SAD_SOUND_TRIGGER(PARAM) (((PARAM) == MDF_SAD_ENTER_DETECT) || \
                                         ((PARAM) == MDF_SAD_ENTER_EXIT_DETECT))

#define IS_MDF_SAD_DATA_MEMORY_TRANSFER(PARAM) (((PARAM) == MDF_SAD_NO_MEMORY_TRANSFER)        || \
                                                ((PARAM) == MDF_SAD_MEMORY_TRANSFER_IN_DETECT) || \
                                                ((PARAM) == MDF_SAD_MEMORY_TRANSFER_ALWAYS))

#define IS_MDF_SAD_MIN_NOISE_LEVEL(PARAM) ((PARAM) <= 8191U)

#define IS_MDF_SAD_HANGOVER_WINDOW(PARAM) (((PARAM) == MDF_SAD_HANGOVER_4_FRAMES)   || \
                                           ((PARAM) == MDF_SAD_HANGOVER_8_FRAMES)   || \
                                           ((PARAM) == MDF_SAD_HANGOVER_16_FRAMES)  || \
                                           ((PARAM) == MDF_SAD_HANGOVER_32_FRAMES)  || \
                                           ((PARAM) == MDF_SAD_HANGOVER_64_FRAMES)  || \
                                           ((PARAM) == MDF_SAD_HANGOVER_128_FRAMES) || \
                                           ((PARAM) == MDF_SAD_HANGOVER_256_FRAMES) || \
                                           ((PARAM) == MDF_SAD_HANGOVER_512_FRAMES))

#define IS_MDF_SAD_LEARNING_FRAMES(PARAM) (((PARAM) == MDF_SAD_LEARNING_2_FRAMES)  || \
                                           ((PARAM) == MDF_SAD_LEARNING_4_FRAMES)  || \
                                           ((PARAM) == MDF_SAD_LEARNING_8_FRAMES)  || \
                                           ((PARAM) == MDF_SAD_LEARNING_16_FRAMES) || \
                                           ((PARAM) == MDF_SAD_LEARNING_32_FRAMES))

#define IS_MDF_SAD_AMBIENT_NOISE_SLOPE(PARAM) ((PARAM) <= 7U)

#define IS_MDF_SAD_SIGNAL_NOISE_THRESHOLD(PARAM) (((PARAM) == MDF_SAD_SIGNAL_NOISE_3_5DB)  || \
                                                  ((PARAM) == MDF_SAD_SIGNAL_NOISE_6DB)    || \
                                                  ((PARAM) == MDF_SAD_SIGNAL_NOISE_9_5DB)  || \
                                                  ((PARAM) == MDF_SAD_SIGNAL_NOISE_12DB)   || \
                                                  ((PARAM) == MDF_SAD_SIGNAL_NOISE_15_6DB) || \
                                                  ((PARAM) == MDF_SAD_SIGNAL_NOISE_18DB)   || \
                                                  ((PARAM) == MDF_SAD_SIGNAL_NOISE_21_6DB) || \
                                                  ((PARAM) == MDF_SAD_SIGNAL_NOISE_24_1DB) || \
                                                  ((PARAM) == MDF_SAD_SIGNAL_NOISE_27_6DB) || \
                                                  ((PARAM) == MDF_SAD_SIGNAL_NOISE_30_1DB))
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32H7RSxx_HAL_MDF_H */
